In [30]:
import os
import pymysql
import pandas as pd

host = '127.0.0.1'
port = "3306"
user = 'root'
password = ''
database = 'classicmodels'

conn = pymysql.connect(
    host=host,
    port=int(port),
    user=user,
    passwd=password,
    db=database,
    charset='utf8mb4')

def run(sql):
    df = pd.read_sql_query(sql,conn)
    return df

In [5]:
# sql = 'select * from employees'
sql = 'show tables'

run(sql)

  Tables_in_classicmodels
0               customers
1               employees
2                 offices
3            orderdetails
4                  orders
5                payments
6            productlines
7                products

In [7]:
sql = "SELECT CONCAT(firstName,' ',lastName) AS fullName FROM employees"

run(sql)

             fullName
0        Diane Murphy
1      Mary Patterson
2       Jeff Firrelli
3   William Patterson
4       Gerard Bondur
5         Anthony Bow
6     Leslie Jennings
7     Leslie Thompson
8      Julie Firrelli
9     Steve Patterson
10     Foon Yue Tseng
11      George Vanauf
12        Loui Bondur
13   Gerard Hernandez
14    Pamela Castillo
15         Larry Bott
16        Barry Jones
17        Andy Fixter
18        Peter Marsh
19           Tom King
20         Mami Nishi
21       Yoshimi Kato
22      Martin Gerard

In [8]:
sql = 'SELECT orderNumber,YEAR(orderDate),MONTH(orderDate),DAY(orderDate) FROM orders'

run(sql)

     orderNumber  YEAR(orderDate)  MONTH(orderDate)  DAY(orderDate)
0          10100             2003                 1               6
1          10101             2003                 1               9
2          10102             2003                 1              10
3          10103             2003                 1              29
4          10104             2003                 1              31
5          10105             2003                 2              11
6          10106             2003                 2              17
7          10107             2003                 2              24
8          10108             2003                 3               3
9          10109             2003                 3              10
10         10110             2003                 3              18
11         10111             2003                 3              25
12         10112             2003                 3              24
13         10113             2003                 3              26
14         10114             2003                 4               1
15         10115             2003                 4               4
16         10116             2003                 4              11
17         10117             2003                 4              16
18         10118             2003                 4              21
19         10119             2003                 4              28
20         10120             2003                 4              29
21         10121             2003                 5               7
22         10122             2003                 5               8
23         10123             2003                 5              20
24         10124             2003                 5              21
25         10125             2003                 5              21
26         10126             2003                 5              28
27         10127             2003                 6               3
28         10128             2003                 6               6
29         10129             2003                 6              12
..           ...              ...               ...             ...
296        10396             2005                 3              23
297        10397             2005                 3              28
298        10398             2005                 3              30
299        10399             2005                 4               1
300        10400             2005                 4               1
301        10401             2005                 4               3
302        10402             2005                 4               7
303        10403             2005                 4               8
304        10404             2005                 4               8
305        10405             2005                 4              14
306        10406             2005                 4              15
307        10407             2005                 4              22
308        10408             2005                 4              22
309        10409             2005                 4              23
310        10410             2005                 4              29
311        10411             2005                 5               1
312        10412             2005                 5               3
313        10413             2005                 5               5
314        10414             2005                 5               6
315        10415             2005                 5               9
316        10416             2005                 5              10
317        10417             2005                 5              13
318        10418             2005                 5              16
319        10419             2005                 5              17
320        10420             2005                 5              29
321        10421             2005                 5              29
322        10422             2005                 5              30
323        10423             2005                 5              30
324        10424             2005                 5              31
325        10425             2005                 5              31

[326 rows x 4 columns]

In [12]:
# DISTINCT : Lihat Perbedaan dari Query dibawah ini
# run("SELECT lastName FROM employees")
run("SELECT DISTINCT lastName FROM employees")

     lastName
0      Murphy
1   Patterson
2    Firrelli
3      Bondur
4         Bow
5    Jennings
6    Thompson
7       Tseng
8      Vanauf
9   Hernandez
10   Castillo
11       Bott
12      Jones
13     Fixter
14      Marsh
15       King
16      Nishi
17       Kato
18     Gerard

# 2. Kondisi dengan WHERE

In [13]:
sql = """SELECT   customername,
         country,
         state,
         creditlimit
FROM customers
WHERE country = 'USA'
        AND state = 'CA'
        AND creditlimit > 100000"""

run(sql)

                   customername country state  creditlimit
0  Mini Gifts Distributors Ltd.     USA    CA     210500.0
1  Collectable Mini Designs Co.     USA    CA     105000.0
2      Corporate Gift Ideas Co.     USA    CA     105000.0

In [14]:
sql = "SELECT firstName,lastName,jobTitle,officeCode FROM employees WHERE jobTitle='Sales Rep' AND officeCode=1"

run(sql)

  firstName  lastName   jobTitle officeCode
0    Leslie  Jennings  Sales Rep          1
1    Leslie  Thompson  Sales Rep          1

In [23]:
sql = """select * from orders 
          where orderdate between '2003-01-06' and '2003-01-29'
        """

run(sql)

,orderNumber,orderDate,requiredDate,shippedDate,status,comments,customerNumber
0,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,None,363
1,10101,2003-01-09,2003-01-18,2003-01-11,Shipped,Check on availability.,128
2,10102,2003-01-10,2003-01-18,2003-01-14,Shipped,None,181
3,10103,2003-01-29,2003-02-07,2003-02-02,Shipped,None,121

# 3. Mengurutkan Hasil dengan Order By

In [15]:
sql = "SELECT productName,productLine,buyPrice FROM products WHERE buyPrice>30 ORDER BY productLine,buyPrice"

run(sql)

                                    productName       productLine  buyPrice
0                       1970 Plymouth Hemi Cuda      Classic Cars     31.92
1                         1961 Chevrolet Impala      Classic Cars     32.33
2                            1970 Dodge Coronet      Classic Cars     32.37
3                         1957 Ford Thunderbird      Classic Cars     34.21
4                     1971 Alpine Renault 1600s      Classic Cars     38.58
5                               1982 Camaro Z28      Classic Cars     46.53
6                            1949 Jaguar XK 120      Classic Cars     47.25
7                          1969 Dodge Super Bee      Classic Cars     49.05
8                    1970 Chevy Chevelle SS 454      Classic Cars     49.24
9                     1969 Chevrolet Camaro Z28      Classic Cars     50.51
10                  1948 Porsche 356-A Roadster      Classic Cars     53.90
11                 1999 Indy 500 Monte Carlo SS      Classic Cars     56.76
12                            1985 Toyota Supra      Classic Cars     57.01
13                           1969 Dodge Charger      Classic Cars     58.73
14                          2002 Chevy Corvette      Classic Cars     62.11
15               1948 Porsche Type 356 Roadster      Classic Cars     62.16
16                        1965 Aston Martin DB5      Classic Cars     65.96
17            1992 Porsche Cayenne Turbo Silver      Classic Cars     69.78
18                    1957 Corvette Convertible      Classic Cars     69.93
19                            1952 Citroen-15CV      Classic Cars     72.82
20                        1976 Ford Gran Torino      Classic Cars     73.49
21                           1968 Dodge Charger      Classic Cars     75.16
22                  1992 Ferrari 360 Spider red      Classic Cars     77.90
23                             1969 Ford Falcon      Classic Cars     83.05
24                              1993 Mazda RX-7      Classic Cars     83.51
25                          1972 Alfa Romeo GTA      Classic Cars     85.68
26                           1969 Corvair Monza      Classic Cars     89.14
27                        1970 Triumph Spitfire      Classic Cars     91.92
28                             1995 Honda Civic      Classic Cars     93.89
29                            1968 Ford Mustang      Classic Cars     95.34
..                                          ...               ...       ...
64                               The Queen Mary             Ships     53.63
65                        18th century schooner             Ships     82.34
66               1962 City of Detroit Streetcar            Trains     37.49
67                     Collectable Wooden Train            Trains     67.56
68  1996 Peterbilt 379 Stake Bed with Outrigger  Trucks and Buses     33.61
69                  1980’s GM Manhattan Express  Trucks and Buses     53.93
70                            1957 Chevy Pickup  Trucks and Buses     55.70
71                       1940 Ford Pickup Truck  Trucks and Buses     58.33
72                     1962 Volkswagen Microbus  Trucks and Buses     61.34
73             Diamond T620 Semi-Skirted Tanker  Trucks and Buses     68.29
74                       1964 Mercedes Tour Bus  Trucks and Buses     74.86
75                               1958 Setra Bus  Trucks and Buses     77.90
76                             1940s Ford truck  Trucks and Buses     84.76
77                     1928 Ford Phaeton Deluxe      Vintage Cars     33.02
78                           1911 Ford Town Car      Vintage Cars     33.30
79                           1934 Ford V8 Coupe      Vintage Cars     34.35
80          1932 Alfa Romeo 8C2300 Spider Sport      Vintage Cars     43.26
81             1912 Ford Model T Delivery Wagon      Vintage Cars     46.91
82                     1940 Ford Delivery Sedan      Vintage Cars     48.64
83                          1904 Buick Runabout      Vintage Cars     52.66
84                        1936 Chrysler Airflow      Vintage Cars     57.46
85                     1917 Maxwell Touring Car      Vintage Cars     57.54
86                    1932 Model A Ford J-Coupe      Vintage Cars     58.48
87                         1937 Lincoln Berline      Vintage Cars     60.62
88          18th Century Vintage Horse Carriage      Vintage Cars     60.74
89                  1913 Ford Model T Speedster      Vintage Cars     60.78
90      1941 Chevrolet Special Deluxe Cabriolet      Vintage Cars     64.58
91                            1903 Ford Model A      Vintage Cars     68.30
92                       1928 Mercedes-Benz SSK      Vintage Cars     72.56
93                     1917 Grand Touring Sedan      Vintage Cars     86.70

[94 rows x 3 columns]

# 4. Membatasi Hasil Dengan Limit

In [17]:
sql = "SELECT productName,productLine,buyPrice FROM products WHERE buyPrice>30 ORDER BY productLine,buyPrice LIMIT 10,10"

run(sql)

                         productName   productLine  buyPrice
0        1948 Porsche 356-A Roadster  Classic Cars     53.90
1       1999 Indy 500 Monte Carlo SS  Classic Cars     56.76
2                  1985 Toyota Supra  Classic Cars     57.01
3                 1969 Dodge Charger  Classic Cars     58.73
4                2002 Chevy Corvette  Classic Cars     62.11
5     1948 Porsche Type 356 Roadster  Classic Cars     62.16
6              1965 Aston Martin DB5  Classic Cars     65.96
7  1992 Porsche Cayenne Turbo Silver  Classic Cars     69.78
8          1957 Corvette Convertible  Classic Cars     69.93
9                  1952 Citroen-15CV  Classic Cars     72.82

# 5. Pencarian String

In [18]:
sql = """
SELECT 
    employeeNumber, 
    lastName, 
    firstName
FROM
    employees
WHERE
    firstName LIKE 'a%'
"""

run(sql)

   employeeNumber lastName firstName
0            1143      Bow   Anthony
1            1611   Fixter      Andy

In [27]:
sql ="""
SELECT 
    productCode, 
    productName
FROM
    products
WHERE
    productCode LIKE '%\_20%';
"""

run(sql)

  productCode                                productName
0    S10_2016                      1996 Moto Guzzi 1100i
1    S24_2000                   1960 BSA Gold Star DBD34
2    S24_2011                      18th century schooner
3    S24_2022  1938 Cadillac V-16 Presidential Limousine
4   S700_2047                                 HMS Bounty

In [26]:
sql = """
SELECT 
    employeeNumber, 
    lastName, 
    firstName
FROM
    employees
WHERE
    firstName LIKE 'a%'
"""

run(sql)

   employeeNumber lastName firstName
0            1143      Bow   Anthony
1            1611   Fixter      Andy

In [25]:
sql = """
SELECT 
    employeeNumber, 
    lastName, 
    firstName
FROM
    employees
WHERE
    firstname LIKE 'T_m'
"""

run(sql)

   employeeNumber lastName firstName
0            1619     King       Tom

# 6. Aggregasi

In [24]:
sql = """
SELECT 
    YEAR(paymentDate) AS Tahun,
    MONTH(paymentDate) AS Bulan,
    SUM(amount) AS TotalBayar 
FROM payments 
GROUP BY Tahun,Bulan
HAVING TotalBayar > 300000
ORDER BY TotalBayar DESC
"""

run(sql)

   Tahun  Bulan  TotalBayar
0   2004     11   857187.30
1   2003     12   826637.64
2   2004     12   819285.62
3   2003     11   694292.68
4   2004      9   476445.53
5   2004      3   404603.21
6   2005      3   385268.09
7   2004      8   378094.30
8   2003     10   316857.96

In [34]:
sql = """ select year(paymentdate) tahun, month(paymentdate) bulan, sum(amount) totalbayar
    FROM payments 
GROUP BY Tahun,Bulan
HAVING TotalBayar > 300000
ORDER BY TotalBayar DESC
LIMIT 5
"""

run(sql)

   tahun  bulan  totalbayar
0   2004     11   857187.30
1   2003     12   826637.64
2   2004     12   819285.62
3   2003     11   694292.68
4   2004      9   476445.53